Repository: Leon-sun/language-assistant
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: Dictionary Project
fr: Projet Dictionnaire

source: Home
fr: Accueil

source: Lookup Word
fr: Rechercher un mot

source: Word List
fr: Liste de mots

source: Stories
fr: Actualités

source: About
fr: À propos

source: Built with Django
fr: Construit avec Django

source: Welcome to Dictionary Project
fr: Bienvenue au Projet Dictionnaire

source: A powerful French-English dictionary application powered by Django and Google Gemini AI.
fr: Une application de dictionnaire français-anglais puissante propulsée par Django et Google Gemini AI.

source: Features
fr: Fonctionnalités

source: Lookup French or English words
fr: Rechercher des mots français ou anglais

source: Get translations and explanations in both languages
fr: Obtenir des traductions et des explications dans les deux langues

source: View 3 usage examples for each word
fr: Voir 3 exemples d'utilisation pour chaque mot

source: Save words to your personal dictionary
fr: Enregistrer des mots dans votre dictionnaire personnel

source: Manage your word list with filters
fr: Gérer votre liste de mots avec des filtres

source: Track difficulty level and familiarity
fr: Suivre le niveau de difficulté et la familiarité

source: View Word List
fr: Voir la liste de mots
